Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K43B.tmx
Source language: en_us
Languages: zh_cn

source: Butterflies
zh_cn: 蝴蝶

source: There was a time in my life when beauty meant something special to me.
zh_cn: 在我生命中曾经有段时间美对我有着特别的意义。

source: I guess that would have been when I was about six or seven years old, just several weeks or maybe a month before the orphanage turned me into an old man.
zh_cn: 我想那可能是在我六七岁的时候，离孤儿院把我变成一个老头只有几个星期或者大概一个月。

source: I would get up every morning at the orphanage, make my bed just like the little soldier that I had become and then I would get into one of the two straight lines and march to breakfast with the other twenty or thirty boys who also lived in my dormitory.
zh_cn: 每天早上我在孤儿院起床，像个小士兵一样整理床铺——我已经变成了小士兵，然后我加入到两条排列整齐的队伍中的一条，与也住在我宿舍里的另外二三十个男孩一起排队吃早餐。

source: After breakfast one Saturday morning I returned to the dormitory and saw the house parent chasing the beautiful monarch butterflies who lived by the hundreds in the azalea bushes strewn around the orphanage.
zh_cn: 一个星期六的早上，早饭后我返回宿舍，看到舍监正在捕捉那些美丽的黑脉金斑蝶，这些蝴蝶数以百计地生活在遍布孤儿院的杜鹃花丛中。

source: I carefully watched as he caught these beautiful creatures, one after the other, and then took them from the net and then stuck straight pins through their head and wings, pinning them onto a heavy cardboard sheet.
zh_cn: 在他捉这些美丽的动物时我小心翼翼地看着，他捉了一只又一只，然后把它们从网中拿出来，用大头针穿过它们的头和翅膀，把它们钉在一块厚纸板上。

source: How cruel it was to kill something of such beauty.
zh_cn: 杀死这么美丽的东西是多残忍啊。

source: I had walked many times out into the bushes, all by myself, just so the butterflies could land on my head, face and hands so I could look at them up close.
zh_cn: 我曾经很多次走进花丛，就我一个人，只有这样这些蝴蝶才能落在我头上、脸上和手上，我才能近距离地看着它们。

source: When the telephone rang the house parent laid the large cardboard paper down on the back cement step and went inside to answer the phone.
zh_cn: 电话响起的时候，舍监把那块大纸板放在后面的水泥台阶上，然后进去接电话。

source: I walked up to the cardboard and looked at the one butterfly who he had just pinned to the large paper.
zh_cn: 我走近那块纸板，看着他刚刚钉在大纸板上的那只蝴蝶。

source: It was still moving about so I reached down and touched it on the wing causing one of the pins to fall out.
zh_cn: 它还在不停地动，所以我伸手碰了碰它的翅膀，结果使其中一根大头针掉了下来。

source: It started flying around and around trying to get away but it was still pinned by the one wing with the other straight pin.
zh_cn: 它开始转着圈飞，试图逃脱，但它仍被另一根大头针钉住了一只翅膀。

source: Finally it's wing broke off and the butterfly fell to the ground and just quivered.
zh_cn: 最后它的翅膀折断了，蝴蝶落在地上，只是颤抖。

source: I picked up the torn wing and the butterfly and I spat on it's wing and tried to get it to stick back on so it could fly away and be free before the house parent came back.
zh_cn: 我捡起被扯掉的翅膀和那只蝴蝶，我在它的翅膀上吐唾沫，试图把它粘回去，这样它就能在舍监回来之前飞走、重获自由。

source: But it would not stay on him.
zh_cn: 但是粘不住。

source: The next thing I knew the house parent came walking back out of the back door by the garbage room and started yelling at me.
zh_cn: 突然舍监从垃圾房旁边的后门回来了，开始对我大喊大叫。

source: I told him that I did not do anything but he did not believe me.
zh_cn: 我告诉他我什么都没做，但他不相信我。

source: He picked up the cardboard paper and started hitting me on the top of the head.
zh_cn: 他捡起那块纸板，开始打我的头顶。

source: There were all kinds of butterfly pieces going everywhere.
zh_cn: 各种各样的蝴蝶碎片飞得到处都是。

source: He threw the cardboard down on the ground and told me to pick it up and put it in the garbage can inside the back room of the dormitory and then he left.
zh_cn: 他把纸板扔到地上，叫我捡起来，放到宿舍后面房间里的垃圾筒里，然后他离开了。

source: I sat there in the dirt, by that big old tree, for the longest time trying to fit all the butterfly pieces back together so I could bury them whole, but it was too hard to do.
zh_cn: 我坐在泥土里，在那棵巨大的老树旁，用了很长的时间试图把所有的蝴蝶碎片都安回去，这样我就能够把它们整个地埋葬了，但是太难了，做不到。

source: So I prayed for them and then I put them in an old torn up shoe box and I buried them in the bottom of the fort that I had built in the ground, out by the large bamboos, near the blackberry bushes.
zh_cn: 所以我为它们祈祷，然后把它们放进一个破旧的鞋盒里，埋在我在地上建的城堡底部，在大竹林的外面，靠近黑莓丛。

source: Every year when the butterflies would return to the orphanage and try to land on me I would try and shoo them away because they did not know that the orphanage was a bad place to live and a very bad place to die.
zh_cn: 每年当蝴蝶返回孤儿院、想要落在我身上时，我都要试着发出嘘声把它们赶走，因为它们不知道孤儿院不是一个适合居住的地方，更不是一个适合死的地方。
